#include<stdio.h>
//矩形相乘的条件：前一个矩阵的列数=后一个矩阵的行数 
const int N = 3, P = 4, M = 2;  
int main() {
//二维数组前一个[]表示矩阵的行数，后一个[]表示矩阵的列数。 
  int a[N][P] = {{4, -1, 2, 1}, {1, 1, 0, 3}, {0, 3, 1, 4}},
      b[P][M] = {{1, 2}, {0, 1}, {3, 0}, {-1, 2}},
      c[N][M] = {0};
//算出第一个矩阵第一行和第二矩阵的第一列对应元素积之和。 
  for (int i = 0; i < N; i++) 
    for (int j = 0; j < M; j++)
      for (int k = 0; k < P; k++)
        c[i][j] += a[i][k] * b[k][j]; 
//打印最后的值，并在每行最后一列（跳出j循环后）加上换行。 
  for (int i = 0; i < N; i++) {
    for (int j = 0; j < M; j++)
      printf("%3d", c[i][j]);
    printf("\n");
  }
}
